app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT `posts`.* FROM `posts` ORDER BY id desc

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `created_by`, `lock_version`, `thumbnail`, `title`, `updated_at`, `updated_by`) VALUES ('<h1>これは面白いぜ！！</h1>\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/98WtmW-lfeE?rel=0\" frameborder=\"0\" allowfullscreen></iframe>', '2014-02-13 03:45:52', 1, 0, '', '初めての投稿', '2014-02-13 03:45:52', 1)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `thumbnail` = '<img src=\"http://www.dvinfo.net/forum/attachments/wedding-event-videography-techniques/3371d1181053656-where-find-green-preview-screen-movie-preview2.jpg\" />', `updated_at` = '2014-02-13 06:13:32', `lock_version` = 1 WHERE (`posts`.`id` = 1 AND `posts`.`lock_version` = 0)